posts/Linux/2015-04-25-exiv2-Command-Line-Power.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-09-20 Tue 11:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>exiv2 command line power</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Manipulate multiple image files and their Exif data on the command line."
 />
<meta name="keywords" content="Image, Picture, Photo, Exif, Command Line, Batch Manipulation, Linux" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">exiv2 command line power</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ad2355">Examples from the manual</a></li>
<li><a href="#org970d5ba">Adjust date and time</a></li>
<li><a href="#orgfb24ebe">Batch rename</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2015-04-25 Sat&gt; </span></span> Does this sound familiar to you: You come back from a
holiday with your family or friends and want to merge photos taken
with 4 different cameras.  However, somebody forgot to adjust the date
(or did not set the daylight saving time accordingly).  Hmm.
</p>

<p>
This problem can be solved easily.  <code>exiv2</code> is a program to read and
write Exif image metadata and image comments.  It offers a very easy
command line interface and shortcuts to batch rename files (e.g., by
time and date) or to change Exif flags.
</p>

<p>
The <a href="http://www.exiv2.org/"><code>exiv2</code> homepage</a>.
</p>

<div id="outline-container-org4ad2355" class="outline-2">
<h2 id="org4ad2355">Examples from the manual</h2>
<div class="outline-text-2" id="text-org4ad2355">
<p>
Some examples from the manual (<code>man exiv2</code>):
</p>
<dl class="org-dl">
<dt><code>exiv2 *.jpg</code></dt><dd>Prints a summary of the Exif information for all
JPEG files in the directory.</dd>
<dt><code>exiv2 rename img_1234.jpg</code></dt><dd>Renames <code>img_1234.jpg</code> (taken on
13-Nov-05 at 22:58:31) to <code>20051113_225831.jpg</code>.</dd>
<dt><code>exiv2 -r':basename:_%Y%m' rename img_1234.jpg</code></dt><dd>Renames
<code>img_1234.jpg</code> to <code>img_1234_200511.jpg</code>.</dd>
<dt><code>exiv2 -et img1.jpg img2.jpg</code></dt><dd>Extracts the Exif thumbnails from
the two files into <code>img1-thumb.jpg</code> and <code>img2-thumb.jpg</code>.</dd>
</dl>
</div>
</div>

<div id="outline-container-org970d5ba" class="outline-2">
<h2 id="org970d5ba">Adjust date and time</h2>
<div class="outline-text-2" id="text-org970d5ba">
<p>
We use the adjust switch from above:
</p>
<dl class="org-dl">
<dt>ad | adjust</dt><dd>Adjust Exif time stamps by the given time.  Time
adjustment is in the format <code>[-]HH[:MM[:SS]]</code>.  Examples: <code>1</code>
adds one hour, <code>1:01</code> adds one hour and one minute, <code>-0:00:30</code>
subtracts 30 seconds.</dd>
</dl>
<p>
An example:
</p>
<div class="org-src-container">
<pre class="src src-sh">exiv2 adjust -a 1 *.jpg
</pre>
</div>
<p>
adds one hour to the time stamp of all JPG files in the working
directory.
</p>
</div>
</div>

<div id="outline-container-orgfb24ebe" class="outline-2">
<h2 id="orgfb24ebe">Batch rename</h2>
<div class="outline-text-2" id="text-orgfb24ebe">
<p>
After you have adjusted the time stamps of the different cameras, you
may want to rename the files, e.g.:
</p>
<div class="org-src-container">
<pre class="src src-sh">exiv2 rename *.jpg
</pre>
</div>
<p>
renames all JPG files in the working directory to <code>date_time.jpg</code>,
something very useful.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(exiv2 command line power)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><div class='footer'>
Copyright 2015 Dominik Schrempf<br/>
Last updated <span class="timestamp-wrapper"><span class="timestamp">2016-09-20</span></span><br/>
Built with <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.5) <br/>
<a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML
</div>
<script type='text/javascript'>
 (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
 (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
 m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
 })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

 ga('create', 'UA-57993874-1', 'auto');
 ga('send', 'pageview');

</script>
</div>
</body>
</html>
